Revit 2027 API
MassLevelData.NExteriorSurfaceArea Property
 The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NExteriorSurfaceArea { get; }
Public ReadOnly Property NExteriorSurfaceArea As Double
	Get
public:
property double NExteriorSurfaceArea {
	double get ();
}
member NExteriorSurfaceArea : float with get
Property Value
Double
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace